{
    "variable": {
        "service_name": [
            {
                "type": "string",
                "description": "The service name. For AWS services the service name is usually in the form com.amazonaws.<region>.<service> (the SageMaker Notebook service is an exception to this rule, the service name is in the form aws.sagemaker.<region>.notebook).",
                "nullable": true
            }
        ],
        "vpc_id": [
            {
                "type": "string",
                "description": "The ID of the VPC in which the endpoint will be used.",
                "nullable": false
            }
        ],
        "auto_accept": [
            {
                "type": "bool",
                "description": "Accept the VPC endpoint (the VPC endpoint and service need to be in the same AWS account).",
                "nullable": true
            }
        ],
        "policy": [
            {
                "type": "string",
                "description": "A policy to attach to the endpoint that controls access to the service. This is a JSON formatted string.",
                "nullable": true
            }
        ],
        "private_dns_enabled": [
            {
                "type": "bool",
                "description": "(AWS services and AWS Marketplace partner services only) Whether or not to associate a private hosted zone with the specified VPC. Applicable for endpoints of type Interface. Most users will want this enabled to allow services within the VPC to automatically use the endpoint.",
                "default": false,
                "nullable": true
            }
        ],
        "dns_options": [
            {
                "type": "list(object({dns_record_ip_type: string, private_dns_only_for_inbound_resolver_endpoint: bool}))",
                "description": "he DNS options for the endpoint.",
                "nullable": true
            }
        ],
        "ip_address_type": [
            {
                "type": "string",
                "description": "The IP address type for the endpoint.",
                "nullable": true
            }
        ],
        "route_table_ids": [
            {
                "type": "list(string)",
                "description": "One or more route table IDs. Applicable for endpoints of type Gateway.",
                "nullable": true
            }
        ],
        "subnet_configuration": [
            {
                "type": "list(object({ipv4: string, ipv6: string, subnet_id: string}))",
                "description": "Subnet configuration for the endpoint, used to select specific IPv4 and/or IPv6 addresses to the endpoint.",
                "nullable": true
            }
        ],
        "subnet_ids": [
            {
                "type": "list(string)",
                "description": "The ID of one or more subnets in which to create a network interface for the endpoint. Applicable for endpoints of type GatewayLoadBalancer and Interface. Interface type endpoints cannot function without being assigned to a subnet.",
                "nullable": true
            }
        ],
        "security_group_ids": [
            {
                "type": "list(string)",
                "description": "The ID of one or more security groups to associate with the network interface. Applicable for endpoints of type Interface. If no security groups are specified, the VPC's default security group is associated with the endpoint.",
                "nullable": true
            }
        ],
        "tags": [
            {
                "type": "map(string)",
                "description": "A map of tags to assign to the resource. If configured with a provider default_tags configuration block present, tags with matching keys will overwrite those defined at the provider-level.",
                "nullable": true
            }
        ],
        "vpc_endpoint_type": [
            {
                "type": "string",
                "description": "The VPC endpoint type",
                "default": "Gateway",
                "nullable": true
            }
        ]
    }
}